In [2]:
import numpy as np

In [3]:
arr = np.arange(12).reshape((3,4))

In [4]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [5]:
np.concatenate([arr, arr])

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [7]:
np.concatenate([arr, arr,arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11,  8,  9, 10, 11]])

In [8]:
np.concatenate([arr], axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [10]:
import pandas as pd

In [11]:
s1 = pd.Series([0,1], index=['a','b'])
s2 = pd.Series([2,3,4], index=['c', 'd', 'e'])
s3 = pd.Series([5,6], index=['f','g'])

In [12]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [13]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [15]:
pd.concat([s1, s2, s3], keys=['one', 'two','three'])

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [16]:
pd.concat([s1, s2, s3], keys=['one', 'two','three']).unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [17]:
pd.concat([s1, s2, s3], keys=['one', 'two','three']).unstack().stack()

one    a    0.0
       b    1.0
two    c    2.0
       d    3.0
       e    4.0
three  f    5.0
       g    6.0
dtype: float64

In [18]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [21]:
pd.concat([s1,s2,s3], axis=1, keys=['s1', 's2', 's3'])

    s1   s2   s3
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [20]:
s1

a    0
b    1
dtype: int64

In [1]:
import pandas as pd, numpy as np

In [2]:
series1=pd.Series([1,2,3,4,5,6,np.nan,7, np.nan])
series2=pd.Series([101,np.nan,102,103,104,105,106,107,108])

In [3]:
result_1 = series1.combine_first(series2)

In [4]:
result_1

0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6    106.0
7      7.0
8    108.0
dtype: float64

In [5]:
result_2 = series2.combine_first(series1)

In [6]:
result_2

0    101.0
1      2.0
2    102.0
3    103.0
4    104.0
5    105.0
6    106.0
7    107.0
8    108.0
dtype: float64

In [1]:
import numpy as np, pandas as pd

In [2]:
data = pd.DataFrame(np.arange(6).reshape((2,3)),
                    
                    index = pd.Index(['Ohio','Colorado'], 
                                     name='state'),
                    
                    columns=pd.Index(['One','Two','Three'], 
                                     name='number'))

In [3]:
data

number    One  Two  Three
state
Ohio        0    1      2
Colorado    3    4      5

In [10]:
result=data.stack()

In [11]:
result

state     number
Ohio      One       0
          Two       1
          Three     2
Colorado  One       3
          Two       4
          Three     5
dtype: int64

In [12]:
result.unstack()

number    One  Two  Three
state
Ohio        0    1      2
Colorado    3    4      5

In [13]:
result.unstack(0)

state   Ohio  Colorado
number
One        0         3
Two        1         4
Three      2         5

In [14]:
result.unstack(1)

number    One  Two  Three
state
Ohio        0    1      2
Colorado    3    4      5

In [15]:
s1 = pd.Series(
                [0,1,2,3], 
                index=['a','b','c','d']
            )

In [16]:
s1

a    0
b    1
c    2
d    3
dtype: int64

In [17]:
s2 = pd.Series(
                [4,5,6], 
                index=['c','d','e']
            )

In [18]:
s2

c    4
d    5
e    6
dtype: int64

In [22]:
s2.unstack()

ValueError: index must be a MultiIndex to unstack, <class 'pandas.core.indexes.base.Index'> was passed

In [23]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [24]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [28]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [30]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [31]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [1]:
# Pivoting long to wide format

In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('/home/showmik/Jupyter_lab/examples/macrodata.csv')

In [4]:
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [5]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter,name='date')

In [6]:
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

In [7]:
columns = pd.Index(['realgdp','infl','unemp'], name = 'item')

In [8]:
columns

Index(['realgdp', 'infl', 'unemp'], dtype='object', name='item')

In [9]:
data = data.reindex(columns = columns)

In [10]:
data

item    realgdp  infl  unemp
0      2710.349  0.00    5.8
1      2778.801  2.34    5.1
2      2775.488  2.74    5.3
3      2785.204  0.27    5.6
4      2847.699  2.31    5.2
..          ...   ...    ...
198   13324.600 -3.16    6.0
199   13141.920 -8.79    6.9
200   12925.410  0.94    8.1
201   12901.504  3.37    9.2
202   12990.341  3.56    9.6

[203 rows x 3 columns]

In [11]:
data.index = periods.to_timestamp('D','end')

In [12]:
data

item                             realgdp  infl  unemp
date
1959-03-31 23:59:59.999999999   2710.349  0.00    5.8
1959-06-30 23:59:59.999999999   2778.801  2.34    5.1
1959-09-30 23:59:59.999999999   2775.488  2.74    5.3
1959-12-31 23:59:59.999999999   2785.204  0.27    5.6
1960-03-31 23:59:59.999999999   2847.699  2.31    5.2
...                                  ...   ...    ...
2008-09-30 23:59:59.999999999  13324.600 -3.16    6.0
2008-12-31 23:59:59.999999999  13141.920 -8.79    6.9
2009-03-31 23:59:59.999999999  12925.410  0.94    8.1
2009-06-30 23:59:59.999999999  12901.504  3.37    9.2
2009-09-30 23:59:59.999999999  12990.341  3.56    9.6

[203 rows x 3 columns]

In [14]:
ldata = data.stack().reset_index().rename(columns={0:'value'})

In [15]:
ldata

                             date     item      value
0   1959-03-31 23:59:59.999999999  realgdp   2710.349
1   1959-03-31 23:59:59.999999999     infl      0.000
2   1959-03-31 23:59:59.999999999    unemp      5.800
3   1959-06-30 23:59:59.999999999  realgdp   2778.801
4   1959-06-30 23:59:59.999999999     infl      2.340
..                            ...      ...        ...
604 2009-06-30 23:59:59.999999999     infl      3.370
605 2009-06-30 23:59:59.999999999    unemp      9.200
606 2009-09-30 23:59:59.999999999  realgdp  12990.341
607 2009-09-30 23:59:59.999999999     infl      3.560
608 2009-09-30 23:59:59.999999999    unemp      9.600

[609 rows x 3 columns]